flowAroundSphere/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*/

// File was generated by SwiftBlock, a Blender 3D addon.

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

deltaT          1;

writeInterval   1;



// ************************************************************************* //


geometry
{
   Sphere
   {
      type triSurfaceMesh;
      file "Sphere.stl";
   }
}
vertices
(
    project (1.0 1.0 1.0) (Sphere)
    project (1.0 1.0 -1.0) (Sphere)
    project (1.0 -1.0 1.0) (Sphere)
    project (1.0 -1.0 -1.0) (Sphere)
    project (-1.0 1.0 1.0) (Sphere)
    project (-1.0 1.0 -1.0) (Sphere)
    project (-1.0 -1.0 1.0) (Sphere)
    project (-1.0 -1.0 -1.0) (Sphere)
    (-3.0 -3.0 3.0)
    (3.0 -3.0 3.0)
    (-9.0 3.0 -3.0)
    (-3.0 3.0 -3.0)
    (-9.0 -3.0 -3.0)
    (3.0 3.0 -3.0)
    (-9.0 3.0 3.0)
    (-3.0 -3.0 -3.0)
    (-9.0 -3.0 3.0)
    (3.0 3.0 3.0)
    (15.0 3.0 -3.0)
    (3.0 -3.0 -3.0)
    (15.0 -3.0 -3.0)
    (-3.0 3.0 3.0)
    (15.0 -3.0 3.0)
    (15.0 3.0 3.0)
);
edges
(
    projectCurve 5 7 (Sphere)
    projectCurve 1 5 (Sphere)
    projectCurve 0 1 (Sphere)
    projectCurve 6 7 (Sphere)
    projectCurve 2 3 (Sphere)
    projectCurve 4 5 (Sphere)
    projectCurve 2 6 (Sphere)
    projectCurve 0 2 (Sphere)
    projectCurve 3 7 (Sphere)
    projectCurve 4 6 (Sphere)
    projectCurve 0 4 (Sphere)
    projectCurve 1 3 (Sphere)
);
faces
(
    project (5 4 0 1) Sphere
    project (1 0 2 3) Sphere
    project (5 1 3 7) Sphere
    project (7 6 4 5) Sphere
    project (3 2 6 7) Sphere
    project (0 4 6 2) Sphere
);
blocks
(
// block id 0 
hex (17 13 19 9 0 1 3 2)  (10 10 20) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
)
// block id 1 
hex (0 1 5 4 17 13 11 21)  (10 10 20) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
)
// block id 2 
hex (17 9 8 21 0 2 6 4)  (10 10 20) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
)
// block id 3 
hex (13 11 15 19 1 5 7 3)  (10 10 20) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
)
// block id 4 
hex (9 19 15 8 2 3 7 6)  (10 10 20) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
(
 (0 0 1) (0 0 1) (3.4641 21 0.0217367) 
)
)
// block id 5 
hex (4 5 7 6 21 11 15 8)  (10 10 20) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
(
 (3.4641 21 46.0052) (0 0 1) (0 0 1) 
)
)
// block id 6 
hex (8 21 11 15 16 14 10 12)  (10 10 10) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
)
// block id 7 
hex (22 23 18 20 9 17 13 19)  (10 10 10) edgeGrading (
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
(
 (0 0 1) (1 10 1) (0 0 1) 
)
)
);

patches
(
     wall sphere
    (
        (5 4 0 1)
        (1 0 2 3)
        (5 1 3 7)
        (7 6 4 5)
        (3 2 6 7)
        (0 4 6 2)
    )
     patch inlet
    (
        (12 16 14 10)
    )
     patch outlet
    (
        (18 23 22 20)
    )
     wall wall
    (
        (17 21 8 9)
        (19 9 8 15)
        (8 21 14 16)
        (11 13 19 15)
        (11 15 12 10)
        (9 19 20 22)
        (15 8 16 12)
        (21 11 10 14)
        (11 21 17 13)
        (19 13 18 20)
        (17 9 22 23)
        (13 17 23 18)
    )
);