flowAroundSphere/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sphere
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          600;
        startFace       41000;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       41600;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       41700;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       41800;
    }
)

// ************************************************************************* //
